In [1]:
import pandas as pd

Data Analysis
1.Description
2.Diagnosis
3.Prediction
4.Actions/Prescription

In [10]:
# Read the files
df = pd.read_csv('u.data', sep='\t',names=cols)

In [5]:
item_cols = ['movie_id','title'] + [str(i) for i in range(22)]

In [9]:
#Read the other file
df1 = pd.read_csv('u.item', sep='|', names = item_cols,
                  encoding = "ISO-8859-1") [['movie_id','title']]

In [ ]:
df1.shape

In [8]:
# The column names
cols = ['user_id','movie_id','rating','ts']

#Exploratory Data Analysis

In [11]:
df.head()

   user_id  movie_id  rating         ts
0        0        50       5  881250949
1        0       172       5  881250949
2        0       133       1  881250949
3      196       242       3  881250949
4      186       302       3  891717742

In [ ]:
df1.sample(3)

In [ ]:
df1.sample(5)

In [ ]:
df.sample(5)

In [ ]:
df.info()

In [12]:
df.describe(include='all')

             user_id       movie_id         rating            ts
count  100003.000000  100003.000000  100003.000000  1.000030e+05
mean      462.470876     425.520914       3.529864  8.835288e+08
std       266.622454     330.797791       1.125704  5.343791e+06
min         0.000000       1.000000       1.000000  8.747247e+08
25%       254.000000     175.000000       3.000000  8.794487e+08
50%       447.000000     322.000000       4.000000  8.828269e+08
75%       682.000000     631.000000       4.000000  8.882600e+08
max       943.000000    1682.000000       5.000000  8.932866e+08

 #Try to find the different data
#1.strings with categorical infp
#2.strings with random stuff
#3.numbers with quantified info
#4.numbers with categorical info
#5.random numbers or ID sort of data

In [28]:
df.columns

Index(['user_id', 'movie_id', 'rating', 'ts'], dtype='object')

In [27]:
df['rating'].unique()

array([5, 1, 3, 2, 4], dtype=int64)

In [29]:
df['rating'].nunique()

5

In [25]:
df['user_id'].nunique()

944

In [26]:
df['movie_id'].nunique()

1682

In [ ]:
# Merging DataFrames

In [18]:
movie = pd.merge(df,df1, on='movie_id')
movie.head()

   user_id  movie_id  rating         ts             title
0        0        50       5  881250949  Star Wars (1977)
1      290        50       5  880473582  Star Wars (1977)
2       79        50       4  891271545  Star Wars (1977)
3        2        50       5  888552084  Star Wars (1977)
4        8        50       5  879362124  Star Wars (1977)

In [19]:
#Remove the redundant or useless columns i.e. ts
movie.drop('ts',axis=1, inplace=True)

In [20]:
movie.head()

   user_id  movie_id  rating             title
0        0        50       5  Star Wars (1977)
1      290        50       5  Star Wars (1977)
2       79        50       4  Star Wars (1977)
3        2        50       5  Star Wars (1977)
4        8        50       5  Star Wars (1977)

In [21]:
# Find the number of ratings for each movie
movie['title'].value_counts().head(10)

Star Wars (1977)                 584
Contact (1997)                   509
Fargo (1996)                     508
Return of the Jedi (1983)        507
Liar Liar (1997)                 485
English Patient, The (1996)      481
Scream (1996)                    478
Toy Story (1995)                 452
Air Force One (1997)             431
Independence Day (ID4) (1996)    429
Name: title, dtype: int64

In [36]:
#Find the average rating for each movie
rating = pd.DataFrame(movie.groupby('title')\
     ['rating'].mean().sort_values(ascending=False)).head(10)

In [37]:
rating

                                                   rating
title
They Made Me a Criminal (1939)                        5.0
Marlene Dietrich: Shadow and Light (1996)             5.0
Saint of Fort Washington, The (1993)                  5.0
Someone Else's America (1995)                         5.0
Star Kid (1997)                                       5.0
Great Day in Harlem, A (1994)                         5.0
Aiqing wansui (1994)                                  5.0
Santa with Muscles (1996)                             5.0
Prefontaine (1997)                                    5.0
Entertaining Angels: The Dorothy Day Story (1996)     5.0

In [41]:
rating['count'] = movie['title'].value_counts()

In [42]:
rating.head(20)

                                                   rating  cpunt  count
title
They Made Me a Criminal (1939)                        5.0      1      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1      1
Saint of Fort Washington, The (1993)                  5.0      2      2
Someone Else's America (1995)                         5.0      1      1
Star Kid (1997)                                       5.0      3      3
Great Day in Harlem, A (1994)                         5.0      1      1
Aiqing wansui (1994)                                  5.0      1      1
Santa with Muscles (1996)                             5.0      2      2
Prefontaine (1997)                                    5.0      3      3
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1      1

In [43]:
rating.sort_values(by='count', ascending=False).head(10)

                                                   rating  cpunt  count
title
Star Kid (1997)                                       5.0      3      3
Prefontaine (1997)                                    5.0      3      3
Saint of Fort Washington, The (1993)                  5.0      2      2
Santa with Muscles (1996)                             5.0      2      2
They Made Me a Criminal (1939)                        5.0      1      1
Marlene Dietrich: Shadow and Light (1996)             5.0      1      1
Someone Else's America (1995)                         5.0      1      1
Great Day in Harlem, A (1994)                         5.0      1      1
Aiqing wansui (1994)                                  5.0      1      1
Entertaining Angels: The Dorothy Day Story (1996)     5.0      1      1

In [45]:
movie_pivot = movie.pivot_table(index= 'user_id',columns= 'title',values= 'rating') 
movie_pivot.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [46]:
movie_selected = 'Star Wars (1977)'

In [47]:
ms_rates = movie_pivot[movie_selected]
ms_rates.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

In [48]:
import warnings
warnings.filterwarnings('ignore')

In [51]:
corrs = movie_pivot.corrwith(ms_rates)
corrs.head(20)

title
'Til There Was You (1997)                      0.872872
1-900 (1994)                                  -0.645497
101 Dalmatians (1996)                          0.211132
12 Angry Men (1957)                            0.184289
187 (1997)                                     0.027398
2 Days in the Valley (1996)                    0.066654
20,000 Leagues Under the Sea (1954)            0.289768
2001: A Space Odyssey (1968)                   0.230884
3 Ninjas: High Noon At Mega Mountain (1998)         NaN
39 Steps, The (1935)                           0.106453
8 1/2 (1963)                                  -0.142977
8 Heads in a Duffel Bag (1997)                -0.577350
8 Seconds (1994)                              -0.755929
A Chef in Love (1996)                          0.868599
Above the Rim (1994)                          -0.645497
Absolute Power (1997)                          0.085440
Abyss, The (1989)                              0.203709
Ace Ventura: Pet Detective (1994)              0.062689
Ace Ventura: When Nature Calls (1995)          0.094514
Across the Sea of Time (1995)                 -0.132453
dtype: float64

In [53]:
corrs.sort_values(ascending=False).head(20)

title
Commandments (1997)                                                                  1.0
Cosi (1996)                                                                          1.0
No Escape (1994)                                                                     1.0
Stripes (1981)                                                                       1.0
Man of the Year (1995)                                                               1.0
Hollow Reed (1996)                                                                   1.0
Beans of Egypt, Maine, The (1994)                                                    1.0
Good Man in Africa, A (1994)                                                         1.0
Old Lady Who Walked in the Sea, The (Vieille qui marchait dans la mer, La) (1991)    1.0
Outlaw, The (1943)                                                                   1.0
Line King: Al Hirschfeld, The (1996)                                                 1.0
Hurricane Streets (1998)                                                             1.0
Scarlet Letter, The (1926)                                                           1.0
Safe Passage (1994)                                                                  1.0
Star Wars (1977)                                                                     1.0
Golden Earrings (1947)                                                               1.0
Full Speed (1996)                                                                    1.0
Twisted (1996)                                                                       1.0
Ed's Next Move (1996)                                                                1.0
Mondo (1996)                                                                         1.0
dtype: float64

In [55]:
corrs_df = pd.DataFrame(corrs, columns= ['Correlation'])
corrs_df.head()

                           Correlation
title
'Til There Was You (1997)     0.872872
1-900 (1994)                 -0.645497
101 Dalmatians (1996)         0.211132
12 Angry Men (1957)           0.184289
187 (1997)                    0.027398

In [57]:
corrs_df['rating'] = rating['rating']
corrs_df['count'] = rating['count']

In [58]:
corrs_df.head()

                           Correlation  rating  count
title
'Til There Was You (1997)     0.872872     NaN    NaN
1-900 (1994)                 -0.645497     NaN    NaN
101 Dalmatians (1996)         0.211132     NaN    NaN
12 Angry Men (1957)           0.184289     NaN    NaN
187 (1997)                    0.027398     NaN    NaN

In [77]:
corrs_df[corrs_df['count']>50].sort_values(
    by='Correlation', ascending=False).head(5)

Empty DataFrame
Columns: [Correlation, rating, count]
Index: []

In [70]:
top_recom=list(corrs_df[corrs_df['count']>50].sort_values(
by='Correlation',ascending=False).head(3).index)

In [74]:
top_recom.remove(movie_selected)

ValueError: list.remove(x): x not in list